tests/fixtures/charges_list.json

{
  "object": "list",
  "total": 3,
  "data": [
  {
    "id": "chg_ff6024ab78980de7",
    "amount": 1000,
    "application_fee": null,
    "created_at": "2015-06-26T22:13:29.000Z",
    "currency": "usd",
    "description": "Test Transaction",
    "metadata": {},
    "refunded": false,
    "remote_id": "ch_16I54f2EZMTOjTLjGB8nd84P",
    "status": "paid"
  },
  {
    "id": "chg_bd55e43a86e6273c",
    "amount": 1000,
    "application_fee": 100,
    "created_at": "2015-06-25T16:33:35.252+00:00",
    "currency": "usd",
    "refunded": false,
    "remote_id": "AP-74C53192SV325032R",
    "status": "completed"
  },
  {
    "id": "chg_61f26f576e9d653e",
    "amount": 1000,
    "application_fee": 100,
    "created_at": "2015-06-25T16:28:24.907+00:00",
    "currency": "usd",
    "refunded": false,
    "remote_id": "AP-2WH96342M5597563F",
    "status": "completed"
  }
  ]
}
